In [1]:
# import libraries

import mysql.connector
from mysql.connector import Error
import pandas as pd

In [2]:
# Create a function to handle the connection
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
        host = host_name,
        user = user_name,
        passwd = user_password)
        print('MySQL database connection successful')
    except Error as err:
        print(f"Error: '{err}'")
    return connection

# MySQL terminal password
pw  = "hakeem123Wikireh"

#MySQL Database name
db = "mysql_python"
connection = create_server_connection("localhost", 'root', pw)

MySQL database connection successful

In [3]:
# Create database mysql_python 

def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print('Database created succeffully')
    except Error as err:
        print(f"Error: '{err}'")
create_database_query = "create database mysql_python"
create_database(connection, create_database_query)

Error: '1007 (HY000): Can't create database 'mysql_python'; database exists'

In [4]:
# Connect to database

def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            passwd = user_password,
            database = db_name)
        print('MySQL database connection successful')
    except Error as err:
        print(f"Error: '{err}'")
    return connection

In [5]:
# Execute SQL queries

def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print('QUery was Successfull')
    except Error as err:
        print(f"Error: '{err}'")

In [7]:
create_orders_table = """
create table orders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(20) not null,
date_ordered date,
quantity int,
unit_price float,
phone_number varchar(20));
"""

#connect to database
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, create_orders_table)

MySQL database connection successful
QUery was Successfull

In [9]:
# Insert data
data_orders = """
insert into orders values
(101, 'Steve', 'Laptop', '2018-06-12', 2, '800', '0245426287'),
(102, 'Jobs', 'Books', '2019-02-10', 10, '12', '0549049556'),
(103, 'Stacy', 'Trousers', '2019-12-25', 5, '50', '0205561402'),
(104, 'Hakeem', 'T-shirt', '2019-07-14', 7, '30', '0592011553'),
(105, 'Ussher', 'Headphones', '2019-05-30', 6, '15', '0209626212'),
(106, 'Evans', 'Smart Tv', '2018-08-20', 4, '70', '0249199946')

"""

connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, data_orders)

MySQL database connection successful
QUery was Successfull

In [13]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

In [14]:
# USing the select statement
q1 = """
select * from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q1)
for result in results:
    print(result)

MySQL database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '0245426287')
(102, 'Jobs', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '0549049556')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '0205561402')
(104, 'Hakeem', 'T-shirt', datetime.date(2019, 7, 14), 7, 30.0, '0592011553')
(105, 'Ussher', 'Headphones', datetime.date(2019, 5, 30), 6, 15.0, '0209626212')
(106, 'Evans', 'Smart Tv', datetime.date(2018, 8, 20), 4, 70.0, '0249199946')

In [16]:
q2 = """
select customer_name, phone_number from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q2)
for result in results:
    print(result)

MySQL database connection successful
('Steve', '0245426287')
('Jobs', '0549049556')
('Stacy', '0205561402')
('Hakeem', '0592011553')
('Ussher', '0209626212')
('Evans', '0249199946')

In [17]:
q3 = """
select year(date_ordered) from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q3)
for result in results:
    print(result)

MySQL database connection successful
(2018,)
(2019,)
(2019,)
(2019,)
(2019,)
(2018,)

In [18]:
q4 = """
select distinct(year(date_ordered)) from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q4)
for result in results:
    print(result)

MySQL database connection successful
(2018,)
(2019,)

In [20]:
q5 = """
select * from orders
where date_ordered < '2018-12-31';
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q5)
for result in results:
    print(result)

MySQL database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '0245426287')
(106, 'Evans', 'Smart Tv', datetime.date(2018, 8, 20), 4, 70.0, '0249199946')

In [26]:
q6 = """
select * from orders
order by unit_price desc;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q6)
for result in results:
    print(result)

MySQL database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '0245426287')
(106, 'Evans', 'Smart Tv', datetime.date(2018, 8, 20), 4, 70.0, '0249199946')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '0205561402')
(104, 'Hakeem', 'T-shirt', datetime.date(2019, 7, 14), 7, 30.0, '0592011553')
(105, 'Ussher', 'Headphones', datetime.date(2019, 5, 30), 6, 15.0, '0209626212')
(102, 'Jobs', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '0549049556')

In [27]:
# Coverting the data into a dataframe in Pandas
from_db = []

for result in results:
    result = list(result)
    from_db.append(result)
columns = ["order_id", "customer_name", "product_name", "date_ordered",
          "quantity", "unit_price", "phone_number"]
df = pd.DataFrame(from_db, columns = columns)

display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,101,Steve,Laptop,2018-06-12,2,800.0,0245426287
1,106,Evans,Smart Tv,2018-08-20,4,70.0,0249199946
2,103,Stacy,Trousers,2019-12-25,5,50.0,0205561402
3,104,Hakeem,T-shirt,2019-07-14,7,30.0,0592011553
4,105,Ussher,Headphones,2019-05-30,6,15.0,0209626212
5,102,Jobs,Books,2019-02-10,10,12.0,0549049556

In [28]:
# Update commad
update = """
update orders
set unit_price = 45
where order_id = 103
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, update)

MySQL database connection successful
QUery was Successfull

In [30]:
q8 = """
select * from orders
where order_id = 103;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q8)
for result in results:
    print(result)

MySQL database connection successful
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 45.0, '0205561402')

In [32]:
# Delete command
delete_orders = """
delete from orders
where order_id = 105
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, delete_orders)

MySQL database connection successful
QUery was Successfull

In [33]:
q9 = """
select * from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q9)
for result in results:
    print(result)

MySQL database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '0245426287')
(102, 'Jobs', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '0549049556')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 45.0, '0205561402')
(104, 'Hakeem', 'T-shirt', datetime.date(2019, 7, 14), 7, 30.0, '0592011553')
(106, 'Evans', 'Smart Tv', datetime.date(2018, 8, 20), 4, 70.0, '0249199946')